# TableCellStyle Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle Class
Members See Also
---
The TableCellStyle class contains the appearance settings for a given table cell, column, or table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TableCellStyle : IDisposable
```

Visual Basic
---
```text
Public Class TableCellStyle _
	Implements IDisposable
```

Visual C++
---
```text
public ref class TableCellStyle : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..TableCellStyle
# See Also
TableCellStyle Members
Autodesk.Revit.DB Namespace